drop database if exists `xscj`;
CREATE DATABASE `xscj` ;
USE `xscj`;
DROP TABLE IF EXISTS `xs`;
CREATE TABLE `xs` (
  `学号` char(6) NOT NULL,
  `姓名` char(8) NOT NULL,
  `专业名` char(10) DEFAULT NULL,
  `性别` tinyint(1) NOT NULL DEFAULT '1' COMMENT '1为男 0为女',
  `出生日期` date NOT NULL,
  `总学分` tinyint(1) DEFAULT NULL,
  `照片` blob,
  `备注` text,
  PRIMARY KEY (`学号`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;
INSERT INTO `xs` VALUES 
    ('081101','王林','计算机',1,'1990-02-10',50,NULL,NULL),
    ('081102','程明','计算机',1,'1991-02-01',50,NULL,NULL),
    ('081103','王燕','计算机',0,'1989-10-06',50,NULL,NULL),
    ('081104','韦严平','计算机',1,'1990-08-26',50,NULL,NULL),
    ('081106','李方方','计算机',1,'1990-11-20',50,NULL,NULL),
    ('081107','李明','计算机',1,'1990-05-01',54,NULL,'提前修完《数据结构》，并获学分'),
    ('081108','林一帆','计算机',1,'1989-08-05',52,NULL,'已提前修完一门课'),
    ('081109','张强民','计算机',1,'1989-08-11',50,NULL,NULL),
    ('081110','张蔚','计算机',0,'1991-07-22',50,NULL,'三好生'),
    ('081111','赵琳','计算机',0,'1990-03-18',50,NULL,NULL),
    ('081113','严红','计算机',0,'1989-08-11',48,NULL,'有一门功课不及格，待补考'),
    ('081201','王敏','通信工程',1,'1989-06-10',42,NULL,NULL),
    ('081202','王林','通信工程',1,'1989-01-29',40,NULL,'有一门课不及格，待补考'),
    ('081203','王玉民','通信工程',1,'1990-03-26',42,NULL,NULL),
    ('081204','马琳琳','通信工程',0,'1989-02-10',42,NULL,NULL),
    ('081206','李计','通信工程',1,'1989-09-20',42,NULL,NULL),
    ('081210','李红庆','通信工程',1,'1989-05-01',44,NULL,'已提前修完一门课，并获得学分'),
    ('081216','孙祥欣','通信工程',1,'1989-03-09',42,NULL,NULL),
    ('081218','孙研','通信工程',1,'1990-10-09',42,NULL,NULL),
    ('081220','吴薇华','通信工程',0,'1990-03-18',42,NULL,NULL),
    ('081221','刘燕敏','通信工程',0,'1989-11-12',42,NULL,NULL),
    ('081241','罗林琳','通信工程',0,'1990-01-30',50,NULL,'转专业学习');